hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
#include <math.h>

#include "driver/gpio.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_continuous.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_log.h"

// Real, silicon DAC hardware (8-bit R-2R ladder) only exists on classic ESP32
// (DAC_CHAN_0 = GPIO25, DAC_CHAN_1 = GPIO26) and ESP32-S2. Every other target
// this file supports (S3/C3/C6/H2) has no analog DAC peripheral at all, so
// those keep using the sigma-delta bitstream approximation further down.
#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2)
#define AFSK_HAS_REAL_DAC 1
#include "driver/dac_oneshot.h"
#endif

#ifdef CONFIG_IDF_TARGET_ESP32
#include "hal/adc_hal.h"
#include "hal/adc_hal_common.h"
// NOTE: ADC_SAMPLE (legacy gptimer + adc_oneshot_read_isr() sampling path,
// further down in this file) is intentionally NOT enabled here anymore.
// adc_oneshot_read()/adc_oneshot_read_isr()'s internal busy-poll for the
// ADC1 conversion-done flag has been observed to never return on this
// board/IDF combo - first as a Guru Meditation "Interrupt wdt timeout on
// CPU0" (stuck inside the ISR variant with interrupts masked), and again as
// a silent, non-crashing infinite loop on CPU1 once the same call was tried
// from task context as a "warm-up". Both are the same underlying hang, just
// reached via different call sites - the fix is to not use the oneshot ADC
// polling path at all, not to keep working around its blocking behavior.
// The adc_continuous (DMA/event-driven) path below already has explicit
// CONFIG_IDF_TARGET_ESP32 handling (see adc_continue_init() and
// s_conv_done_cb), so classic ESP32 now shares the same, non-blocking
// sampling path as every other supported target.
#endif

// #include "cppQueue.h"
#include "fir_filter.h"

#include "driver/sdm.h"
// #include "driver/gptimer.h"

#include <hal/misc.h>
#include <soc/syscon_struct.h>

#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "esp_dsp.h"
#include <dsps_fir.h>
#ifdef CONFIG_IDF_TARGET_ESP32C3
#include <esp32c3/rom/crc.h>
#else
#include "esp32/rom/crc.h"
#endif

#include "soc/syscon_reg.h"
#include "soc/syscon_struct.h"

#include "board_hal.h"
#include "modem.h"
//#include "ws2812_hal.h"
#include "fx25.h"
#include "AFSK.h"

#define DEBUG_TNC

static const char *TAG_AFSK = "AFSK";

// uint16_t bitrate = 1200;
// uint16_t sampleperbit = (SAMPLERATE / bitrate);
// uint8_t bit_sutuff_len = 5;
// uint8_t phase_bits = 32;
// uint8_t phase_inc = 4;
// uint16_t phase_max = (sampleperbit * phase_bits);
// uint16_t phase_threshold = (phase_max / 2);
// uint16_t mark_freq = 1200;
// uint16_t space_freq = 2200;
// uint32_t pll_inc = (1LLU << 32) / sampleperbit;

extern unsigned long custom_preamble;
extern unsigned long custom_tail;
int adcVal;

// bool input_HPF = false;
// bool input_BPF = false;

int8_t _sql_pin, _ptt_pin, _pwr_pin, _dac_pin, _adc_pin;
bool _sql_active, _ptt_active, _pwr_active;

uint8_t adc_atten;

void sample_dac_isr();
volatile bool hw_afsk_dac_isr = false;
volatile uint32_t adcIsrCount = 0; // Diagnostic: counts ADC ISR firings
volatile int fifoSampleCount = 0;  // Diagnostic: snapshot of FIFO count

bool holdADC = false;

// static filter_t bpf;
// static filter_t lpf;
// static filter_t hpf;

// Afsk *AFSK_modem;
// extern Afsk modem;

hw_timer_t *timer_dac = NULL;
hw_timer_t *timer_adc = NULL;

static int Vref = 950;

#define FILTER_TAPS 8 // Number of taps in the FIR filter
uint16_t SAMPLERATE = 38400;
// Resampling configuration
#define INPUT_RATE  38400
#define OUTPUT_RATE 9600
uint16_t RESAMPLE_RATIO = (INPUT_RATE / OUTPUT_RATE); // 38400/9600 = 4
uint16_t BLOCK_SIZE = (INPUT_RATE / 50);              // Must be multiple of resample ratio
float *audio_buffer = NULL;

// AGC configuration
#define AGC_TARGET_RMS 0.2f   // Target RMS level (-10dBFS)
#define AGC_ATTACK     0.02f  // Fast attack rate
#define AGC_RELEASE    0.001f // Slow release rate
#define AGC_MAX_GAIN   10.0f
#define AGC_MIN_GAIN   0.1f

int8_t _led_rx_pin = 2;
int8_t _led_tx_pin = 4;
int8_t _led_strip_pin = -1;
uint8_t r_old = 0, g_old = 0, b_old = 0;
unsigned long rgbTimeout = 0;

extern float markFreq;  // mark frequency
extern float spaceFreq; // space freque
extern float baudRate;  // baudrate

/****************** Ring Buffer gen from DeepSeek *********************/
// #if defined(CONFIG_IDF_TARGET_ESP32S3)
#define BUFFER_SIZE 1500
// #else
// #define BUFFER_SIZE 770
// #endif
typedef struct {
    int16_t buffer[BUFFER_SIZE]; // Buffer to store int16_t data
    int head;                    // Index for the next write
    int tail;                    // Index for the next read
    int count;                   // Number of elements in the buffer
    bool lock;
} RingBuffer;

// Initialize the ring buffer
void IRAM_ATTR RingBuffer_Init(RingBuffer *rb) {
    rb->head = 0;
    rb->tail = 0;
    rb->count = 0;
    rb->lock = false;
}

// Check if the buffer is full
bool IRAM_ATTR RingBuffer_IsFull(const RingBuffer *rb) {
    return rb->count == BUFFER_SIZE;
}

// Check if the buffer is empty
bool IRAM_ATTR RingBuffer_IsEmpty(const RingBuffer *rb) {
    return rb->count == 0;
}

// Add an element to the buffer (push)
bool IRAM_ATTR RingBuffer_Push(RingBuffer *rb, int16_t data) {
    if (RingBuffer_IsFull(rb)) {
        return false; // Buffer is full
    }
    rb->lock = true;
    if (rb->head >= BUFFER_SIZE || rb->head < 0)
        rb->head = 0; // Check if head exceeds buffer size
    rb->buffer[rb->head] = data;
    rb->head = (rb->head + 1) % BUFFER_SIZE; // Wrap around using modulo
    rb->count++;
    rb->lock = false;
    return true;
}

// Remove an element from the buffer (pop)
bool IRAM_ATTR RingBuffer_Pop(RingBuffer *rb, int16_t *data) {
    if (RingBuffer_IsEmpty(rb)) {
        return false; // Buffer is empty
    }
    int to = 0;
    while (rb->lock) // Wait until the buffer is not locked
    {
        delay(1); // Avoid busy-waiting, adjust as needed
        if (to++ > 100)
            return false; // Timeout after 1 second
    }
    if (rb->tail >= BUFFER_SIZE || rb->tail < 0)
        rb->tail = 0; // Check if tail exceeds buffer size
    *data = rb->buffer[rb->tail];
    rb->tail = (rb->tail + 1) % BUFFER_SIZE; // Wrap around using modulo
    rb->count--;
    return true;
}

// Get the number of elements in the buffer
int IRAM_ATTR RingBuffer_Size(const RingBuffer *rb) {
    return rb->count;
}

RingBuffer fifo; // Declare a ring buffer statically (this will be in DRAM, but functions are in IRAM)

extern tcb_t tcb; // defined further down this file; forward-declared for the fullDuplex check below

