hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
// Flush the ADC FIFO — called from ModemTransmitStop() to discard stale
// samples accumulated before/during TX. This is only meaningful in
// half-duplex mode: in full-duplex mode (tcb.fullDuplex, the default) RX
// keeps running throughout TX (see s_conv_done_cb()/AFSK_Poll()), so
// wiping the FIFO the instant TX ends would throw away the tail end of a
// frame that's still legitimately being captured/decoded - including, on
// a wired ADC/DAC loopback, the frame the modem just transmitted itself.
void IRAM_ATTR AFSK_FlushFifo(void) {
    if (!tcb.fullDuplex)
        RingBuffer_Init(&fifo);
}
/******************************************************************** */

// #define MARK_INC (uint16_t)(DIV_ROUND(SIN_LEN * (uint32_t)1200, CONFIG_AFSK_DAC_SAMPLERATE))
// #define SPACE_INC (uint16_t)(DIV_ROUND(SIN_LEN * (uint32_t)2200, CONFIG_AFSK_DAC_SAMPLERATE))

// #if defined(CONFIG_IDF_TARGET_ESP32S3)
// // #define USE_DSP
// #define BAUD_RATE 1200
// #define FILTER_ORDER 64
// // Filter contexts and buffers
// fir_f32_t firMark, firSpace;
// float markBuffer[BLOCK_SIZE];
// float spaceBuffer[BLOCK_SIZE];
// float delayMark[FILTER_ORDER + BLOCK_SIZE] = {0};
// float delaySpace[FILTER_ORDER + BLOCK_SIZE] = {0};

// // Cosine table indexed by unsigned byte.
// static float fcos256_table[256];

// #define fcos256(x) (fcos256_table[((x) >> 24) & 0xff])
// #define fsin256(x) (fcos256_table[(((x) >> 24) - 64) & 0xff])

// const float fir1200[] = {
//     0.00316367f, 0.00398861f, 0.00437723f, 0.00413208f, 0.00298872f, 0.00074047f, -0.00260284f, -0.00668306f, -0.01075057f, -0.01375085f, -0.01454411f,
//     -0.01221729f, -0.00641016f, 0.00244106f, 0.01303073f, 0.02333366f, 0.03097455f, 0.03375193f, 0.03020101f, 0.02005505f, 0.00447537f, -0.01403413f,
//     -0.03204008f, -0.04585163f, -0.05231281f, -0.04953725f, -0.03740889f, -0.01771846f, 0.00611527f, 0.02969454f, 0.04852908f, 0.05896765f, 0.05896765f,
//     0.04852908f, 0.02969454f, 0.00611527f, -0.01771846f, -0.03740889f, -0.04953725f, -0.05231281f, -0.04585163f, -0.03204008f, -0.01403413f, 0.00447537f,
//     0.02005505f, 0.03020101f, 0.03375193f, 0.03097455f, 0.02333366f, 0.01303073f, 0.00244106f, -0.00641016f, -0.01221729f, -0.01454411f, -0.01375085f,
//     -0.01075057f, -0.00668306f, -0.00260284f, 0.00074047f, 0.00298872f, 0.00413208f, 0.00437723f, 0.00398861f, 0.00316367f};
// const float fir2200[] = {
//     0.00231442f, -0.00057143f, -0.00355072f, -0.00511464f, -0.00386876f, 0.00049756f, 0.00630273f, 0.01005055f, 0.00823119f, -0.00000000f, -0.01113572f,
//     -0.01837338f, -0.01552207f, -0.00164028f, 0.01686771f, 0.02888214f, 0.02512596f, 0.00483548f, -0.02209390f, -0.03977362f, -0.03574035f, -0.00950762f,
//     0.02554950f, 0.04903640f, 0.04561719f, 0.01504976f, -0.02642793f, -0.05490854f, -0.05294572f, -0.02045258f, 0.02456674f, 0.05628144f, 0.05628144f,
//     0.02456674f, -0.02045258f, -0.05294572f, -0.05490854f, -0.02642793f, 0.01504976f, 0.04561719f, 0.04903640f, 0.02554950f, -0.00950762f, -0.03574035f,
//     -0.03977362f, -0.02209390f, 0.00483548f, 0.02512596f, 0.02888214f, 0.01686771f, -0.00164028f, -0.01552207f, -0.01837338f, -0.01113572f, -0.00000000f,
//     0.00823119f, 0.01005055f, 0.00630273f, 0.00049756f, -0.00386876f, -0.00511464f, -0.00355072f, -0.00057143f, 0.00231442f};
// // Sample 9600Hz
// //  const float fir1200[] = {
// //
// 0.00207372f,0.00094242f,-0.00108431f,-0.00312228f,-0.00380735f,-0.00194212f,0.00239364f,0.00708630f,0.00861607f,0.00429478f,-0.00511124f,-0.01452088f,-0.01689924f,-0.00805945f,0.00918445f,0.02502154f,0.02797307f,0.01283878f,-0.01410570f,-0.03711208f,-0.04013115f,-0.01784123f,0.01901132f,0.04856762f,0.05104653f,0.02207739f,-0.02290384f,-0.05700372f,-0.05840175f,-0.02463269f,0.02493093f,0.06055125f,0.06055125f,0.02493093f,-0.02463269f,-0.05840175f,-0.05700372f,-0.02290384f,0.02207739f,0.05104653f,0.04856762f,0.01901132f,-0.01784123f,-0.04013115f,-0.03711208f,-0.01410570f,0.01283878f,0.02797307f,0.02502154f,0.00918445f,-0.00805945f,-0.01689924f,-0.01452088f,-0.00511124f,0.00429478f,0.00861607f,0.00708630f,0.00239364f,-0.00194212f,-0.00380735f,-0.00312228f,-0.00108431f,0.00094242f,0.00207372f
// //  };
// //  const float fir2200[] = {
// //
// 0.00043830f,0.00245964f,0.00018549f,-0.00331765f,-0.00132588f,0.00455582f,0.00347822f,-0.00577204f,-0.00701809f,0.00624079f,0.01198993f,-0.00505680f,-0.01795665f,0.00137868f,0.02397076f,0.00528852f,-0.02869738f,-0.01485215f,0.03067614f,0.02651018f,-0.02866679f,-0.03879992f,0.02199267f,0.04982518f,-0.01078912f,-0.05762045f,-0.00391802f,0.06057051f,0.02033804f,-0.05778330f,-0.03622740f,0.04932107f,0.04932107f,-0.03622740f,-0.05778330f,0.02033804f,0.06057051f,-0.00391802f,-0.05762045f,-0.01078912f,0.04982518f,0.02199267f,-0.03879992f,-0.02866679f,0.02651018f,0.03067614f,-0.01485215f,-0.02869738f,0.00528852f,0.02397076f,0.00137868f,-0.01795665f,-0.00505680f,0.01198993f,0.00624079f,-0.00701809f,-0.00577204f,0.00347822f,0.00455582f,-0.00132588f,-0.00331765f,0.00018549f,0.00245964f,0.00043830f
// //  };

// float m_osc_delta, s_osc_delta;
// static inline void push_sample(float val, float *buff, int size)
// {
//   // memccpy(buff + 1, buff, (size - 1) * sizeof(float));
//   memmove(buff + 1, buff, (size - 1));
//   buff[0] = val;
// }
// /* FIR filter kernel. */

// static inline float convolve(const float *data, const float *filter, int filter_taps)
// {
//   float sum = 0.0f;
//   int j;

//   // #pragma GCC ivdep				// ignored until gcc 4.9
//   for (j = 0; j < filter_taps; j++)
//   {
//     sum += filter[j] * data[j];
//   }
//   return (sum);
// }
// #endif

void LED_Status2(uint8_t r, uint8_t g, uint8_t b) {
    // portENTER_CRITICAL_ISR(&ledMux);          // ISR start
    if (r == r_old && g == g_old && b == b_old) {
        rgbTimeout = millis() + 100;
    } else {
        if (millis() > rgbTimeout) {
            rgbTimeout = millis() + 100;
            r_old = r;
            g_old = g;
            b_old = b;
            if (_led_strip_pin > -1) {
                //ws2812_set_pixel(_led_strip_pin, r, g, b);
            } else {
                if (_led_tx_pin > -1) {
                    if (r > 0)
                        digitalWrite(_led_tx_pin, HIGH);
                    else
                        digitalWrite(_led_tx_pin, LOW);
                }
                if (_led_rx_pin > -1) {
                    if (g > 0)
                        digitalWrite(_led_rx_pin, HIGH);
                    else
                        digitalWrite(_led_rx_pin, LOW);
                }
            }
        }
    }
    // portEXIT_CRITICAL_ISR(&ledMux);
}

// const float resample_coeffs[FILTER_TAPS] = {
//   -0.001296,  -0.005406,  -0.012387,  -0.010745,  0.020421,  0.090370,  0.178421,  0.240624,  0.240624,  0.178421,  0.090370,  0.020421,  -0.010745,
//   -0.012387,  -0.005406,  -0.001296
// };
// Filter coefficients (designed for 38400→9600 resampling)
// cutoff = 4800  # Nyquist for 9600Hz
const float resample_coeffs[FILTER_TAPS] = { 0.003560, 0.038084, 0.161032, 0.297324, 0.297324, 0.161032, 0.038084, 0.003560 };
// Filter instance and buffers
fir_f32_t resample_fir;
// float input_buffer[BLOCK_SIZE] = {0};
// float output_buffer[BLOCK_SIZE / RESAMPLE_RATIO] = {0};
// float filter_state[FILTER_TAPS + BLOCK_SIZE - 1] = {0};
void resample_audio(float *input_buffer) {
    // Apply anti-aliasing filter and decimate
    for (int i = 0; i < BLOCK_SIZE / RESAMPLE_RATIO; i++) {
        float sum = 0;
        for (int j = 0; j < FILTER_TAPS; j++) {
            int index = i * RESAMPLE_RATIO + j;
            if (index < BLOCK_SIZE) {
                sum += input_buffer[index] * resample_coeffs[j];
            }
        }
        input_buffer[i] = sum;
    }
}

// AGC state
float agc_gain = 1.0f;

tcb_t tcb;

