hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
// Audio processing
volatile bool new_samples = false;

float update_agc(float *input_buffer, size_t len) {
    // Calculate RMS of current block
    float sum_sq = 0;
    for (int i = 0; i < len; i++) {
        sum_sq += input_buffer[i] * input_buffer[i];
    }
    float rms = sqrtf(sum_sq / len);

    // Adjust gain based on RMS level
    float error = AGC_TARGET_RMS / (rms + 1e-6f);
    float rate = (error < 1.0f) ? AGC_RELEASE : AGC_ATTACK;
    agc_gain = agc_gain * (1.0f - rate) + (agc_gain * error) * rate;
    agc_gain = fmaxf(fminf(agc_gain, AGC_MAX_GAIN), AGC_MIN_GAIN);
    return agc_gain;
}

#define AX25_FLAG      0x7e
#define AX25_MASK      0xfc // bit mask of MSb six bits
#define AX25_EOP       0xfc // end of packet, 7e << 1
#define AX25_STUFF_BIT 0x7c // bit stuffing bit, five of continuous one bits
// #define AX25_MIN_PKT_SIZE (7 * 2 + 1 + 1 + 2) // call sign * 2 + control + PID + FCS
#define AX25_FLAG_BITS 6

#define AX25_ADDR_LEN     7
#define AX25_MIN_PKT_SIZE (AX25_ADDR_LEN * 2 + 1 + 2) // src addr + dst addr + Control + FCS
#define AX25_SSID_MASK    0x0f

// static int ax25_check_fcs(uint8_t data[], int len)
// {
//   // uint16_t fcs, crc;

//   if (len < AX25_MIN_PKT_SIZE)
//     return false;

// #if 0
//     fcs = data[len - 1] << 8 | data[len - 2];
//     crc = crc16_le(0, data, len - 2);

//     static int count = 0;
//     if (fcs == crc && ++count > 10) {
// 	ESP_LOGI(TAG, "GOOD_CRC = %04x", crc16_le(0, data, len));
// 	count = 0;
//     }

//     return fcs == crc;
// #else

// #define GOOD_CRC 0x0f47

//   return crc16_le(0, data, len) == GOOD_CRC;
// #endif
// }

// enum STATE
// {
//   FLAG = 0,
//   DATA
// };

extern AX25Ctx AX25;

#ifdef CONFIG_IDF_TARGET_ESP32
// #define I2S_INTERNAL 1
// #include "driver/i2s.h"
uint8_t adc_pins[] = { 33, 36, 39, 34 }; // GPIO33 (ADC1_CH5) is the real audio-in pin for this board; others are spares
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
uint8_t adc_pins[] = { 1, 2, 3, 4 }; // ADC1 common pins for ESP32S3
#else
uint8_t adc_pins[] = { 0, 2, 3, 4 }; // ADC1 common pins for ESP32S2/S3 + ESP32C3/C6 + ESP32H2
#endif

// adc_continuous_handle_t adc_handle[SOC_ADC_PERIPH_NUM];
// extern adc_handle_t adc_handle[SOC_ADC_PERIPH_NUM];
adc_continuous_handle_t AdcHandle = NULL;
adc_cali_handle_t AdcCaliHandle = NULL;

// Calculate how many pins are declared in the array - needed as input for the setup function of ADC Continuous
uint8_t adc_pins_count = sizeof(adc_pins) / sizeof(uint8_t);

// Flag which will be set in ISR when conversion is done
volatile bool adc_coversion_done = false;

// Result structure for ADC Continuous reading
adc_continuous_data_t *result = NULL;

// adc_atten_t cfg_adc_atten = ADC_ATTEN_DB_0;
#ifdef ADC_SAMPLE
adc_atten_t cfg_adc_atten = ADC_ATTEN_DB_0;
void afskSetADCAtten(uint8_t val) {
    adc_atten = val;
    if (adc_atten == 0) {
        cfg_adc_atten = ADC_ATTEN_DB_0;
        Vref = 950;
    } else if (adc_atten == 1) {
        cfg_adc_atten = ADC_ATTEN_DB_2_5;
        Vref = 1250;
    } else if (adc_atten == 2) {
        cfg_adc_atten = ADC_ATTEN_DB_6;
        Vref = 1750;
    } else if (adc_atten == 3) {
        cfg_adc_atten = ADC_ATTEN_DB_12;
        Vref = 2450;
    } else if (adc_atten == 4) {
        cfg_adc_atten = ADC_ATTEN_DB_12;
        Vref = 3300;
    } else {
        // Out-of-range value (e.g. stale/corrupt config): without this,
        // cfg_adc_atten/Vref would silently keep whatever they last held -
        // defaulting to the ADC_ATTEN_DB_0/950mV file-scope initializer at
        // boot - which saturates the ADC against the DAC's full 0-3.3V
        // loopback swing exactly like a wiring fault would. Fall back to the
        // full 0-3.3V range (option 4), the correct setting for this board's
        // GPIO33/GPIO25 DAC loopback wiring (see app_config.c).
        cfg_adc_atten = ADC_ATTEN_DB_12;
        Vref = 3300;
    }
    analogSetPinAttenuation(adc_pins[0], cfg_adc_atten);
}
#else
adc_atten_t cfg_adc_atten = ADC_ATTEN_DB_0;
void afskSetADCAtten(uint8_t val) {
    adc_atten = val;
    if (adc_atten == 0) {
        cfg_adc_atten = ADC_ATTEN_DB_0;
        Vref = 950;
    } else if (adc_atten == 1) {
        cfg_adc_atten = ADC_ATTEN_DB_2_5;
        Vref = 1250;
    } else if (adc_atten == 2) {
        cfg_adc_atten = ADC_ATTEN_DB_6;
        Vref = 1750;
    } else if (adc_atten == 3) {
        cfg_adc_atten = ADC_ATTEN_DB_12;
        Vref = 2450;
    } else if (adc_atten == 4) {
        cfg_adc_atten = ADC_ATTEN_DB_12;
        Vref = 3300;
    } else {
        // Out-of-range value (e.g. stale/corrupt config): without this,
        // cfg_adc_atten/Vref would silently keep whatever they last held -
        // defaulting to the ADC_ATTEN_DB_0/950mV file-scope initializer at
        // boot - which saturates the ADC against the DAC's full 0-3.3V
        // loopback swing exactly like a wiring fault would. Fall back to the
        // full 0-3.3V range (option 4), the correct setting for this board's
        // GPIO33/GPIO25 DAC loopback wiring (see app_config.c).
        cfg_adc_atten = ADC_ATTEN_DB_12;
        Vref = 3300;
    }
}
#endif

uint8_t CountOnesFromInteger(uint8_t value) {
    uint8_t count;
    for (count = 0; value != 0; count++, value &= value - 1)
        ;
    return count;
}

uint16_t CountOnesFromInteger16(uint16_t value) {
    uint16_t count = 0;
    for (int i = 0; i < 16; i++) {
        if (value & 0x0001)
            count++;
        value >>= 1;
    }
    return count;
}

#define IMPLEMENTATION    FIFO
#define ADC_SAMPLES_COUNT (BLOCK_SIZE / 2)

// #if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6)
// cppQueue adcq(sizeof(int16_t), 768, IMPLEMENTATION, true); // Instantiate queue
// #else
// cppQueue adcq(sizeof(int16_t), 768 * 2, IMPLEMENTATION, true); // Instantiate queue
// #endif

volatile int8_t adcEn = 0;
volatile int8_t dacEn = 0;
volatile bool pttOff = false;

#ifdef I2S_INTERNAL
#define ADC_PATT_LEN_MAX     (16)
#define ADC_CHECK_UNIT(unit) RTC_MODULE_CHECK(adc_unit < ADC_UNIT_2, "ADC unit error, only support ADC1 for now", ESP_ERR_INVALID_ARG)
#define RTC_MODULE_CHECK(a, str, ret_val)                                                                                                                      \
    if (!(a)) {                                                                                                                                                \
        ESP_LOGD(TAG_AFSK, "%s:%d (%s):%s", __FILE__, __LINE__, __FUNCTION__, str);                                                                            \
        return (ret_val);                                                                                                                                      \
    }

i2s_event_t i2s_evt;
static QueueHandle_t i2s_event_queue;

static esp_err_t adc_set_i2s_data_len(adc_unit_t adc_unit, int patt_len) {
    ADC_CHECK_UNIT(adc_unit);
    RTC_MODULE_CHECK((patt_len < ADC_PATT_LEN_MAX) && (patt_len > 0), "ADC pattern length error", ESP_ERR_INVALID_ARG);
    // portENTER_CRITICAL(&rtc_spinlock);
    if (adc_unit & ADC_UNIT_1) {
        SYSCON.saradc_ctrl.sar1_patt_len = patt_len - 1;
    }
    if (adc_unit & ADC_UNIT_2) {
        SYSCON.saradc_ctrl.sar2_patt_len = patt_len - 1;
    }
    // portEXIT_CRITICAL(&rtc_spinlock);
    return ESP_OK;
}

static esp_err_t adc_set_i2s_data_pattern(adc_unit_t adc_unit, int seq_num, adc_channel_t channel, adc_bits_width_t bits, adc_atten_t atten) {
    ADC_CHECK_UNIT(adc_unit);
    if (adc_unit & ADC_UNIT_1) {
        RTC_MODULE_CHECK((adc1_channel_t)channel < ADC1_CHANNEL_MAX, "ADC1 channel error", ESP_ERR_INVALID_ARG);
    }
    RTC_MODULE_CHECK(bits < ADC_WIDTH_MAX, "ADC bit width error", ESP_ERR_INVALID_ARG);
    RTC_MODULE_CHECK(atten <= ADC_ATTEN_DB_12, "ADC Atten Err", ESP_ERR_INVALID_ARG);

