hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
    // portENTER_CRITICAL(&rtc_spinlock);
    // Configure pattern table, each 8 bit defines one channel
    //[7:4]-channel [3:2]-bit width [1:0]- attenuation
    // BIT WIDTH: 3: 12BIT  2: 11BIT  1: 10BIT  0: 9BIT
    // ATTEN: 3: ATTEN = 11dB 2: 6dB 1: 2.5dB 0: 0dB
    uint8_t val = (channel << 4) | (bits << 2) | (atten << 0);
    if (adc_unit & ADC_UNIT_1) {
        SYSCON.saradc_sar1_patt_tab[seq_num / 4] &= (~(0xff << ((3 - (seq_num % 4)) * 8)));
        SYSCON.saradc_sar1_patt_tab[seq_num / 4] |= (val << ((3 - (seq_num % 4)) * 8));
    }
    if (adc_unit & ADC_UNIT_2) {
        SYSCON.saradc_sar2_patt_tab[seq_num / 4] &= (~(0xff << ((3 - (seq_num % 4)) * 8)));
        SYSCON.saradc_sar2_patt_tab[seq_num / 4] |= (val << ((3 - (seq_num % 4)) * 8));
    }
    // portEXIT_CRITICAL(&rtc_spinlock);
    return ESP_OK;
}

void I2S_Init(i2s_mode_t MODE, i2s_bits_per_sample_t BPS) {
    i2s_config_t i2s_config = {
        //.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_TX | I2S_MODE_DAC_BUILT_IN | I2S_MODE_ADC_BUILT_IN),
        .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_ADC_BUILT_IN),
        .sample_rate = SAMPLERATE,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = I2S_CHANNEL_FMT_ALL_LEFT,
        .communication_format = (i2s_comm_format_t)I2S_COMM_FORMAT_I2S_MSB,
        .intr_alloc_flags = 0, // ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count = 5,
        .dma_buf_len = 768 * 2,
        //.tx_desc_auto_clear   = true,
        .use_apll = false // no Audio PLL ( I dont need the adc to be accurate )
    };

    // if (MODE == I2S_MODE_RX || MODE == I2S_MODE_TX)
    // {
    //   ESP_LOGD(TAG_AFSK, "using I2S_MODE");
    //   i2s_pin_config_t pin_config;
    //   pin_config.bck_io_num = PIN_I2S_BCLK;
    //   pin_config.ws_io_num = PIN_I2S_LRC;
    //   if (MODE == I2S_MODE_RX)
    //   {
    //     pin_config.data_out_num = I2S_PIN_NO_CHANGE;
    //     pin_config.data_in_num = PIN_I2S_DIN;
    //   }
    //   else if (MODE == I2S_MODE_TX)
    //   {
    //     pin_config.data_out_num = PIN_I2S_DOUT;
    //     pin_config.data_in_num = I2S_PIN_NO_CHANGE;
    //   }

    //   i2s_driver_install(I2S_NUM_0, &i2s_config, 0, NULL);
    //   i2s_set_pin(I2S_NUM_0, &pin_config);
    //   i2s_set_clk(I2S_NUM_0, SAMPLE_RATE, BPS, I2S_CHANNEL_MONO);
    // }
    // else if (MODE == I2S_MODE_DAC_BUILT_IN || MODE == I2S_MODE_ADC_BUILT_IN)
    // {
    ESP_LOGD(TAG_AFSK, "Using I2S DAC/ADC_builtin");
    // install and start i2s driver
    if (i2s_driver_install(I2S_NUM_0, &i2s_config, 5, &i2s_event_queue) != ESP_OK) {
        ESP_LOGD(TAG_AFSK, "ERROR: Unable to install I2S drives");
    }
    // GPIO36, VP
    // init ADC pad
    i2s_set_adc_mode(ADC_UNIT_1, ADC1_CHANNEL_0);
    // i2s_set_clk(I2S_NUM_0, SAMPLE_RATE, BPS, I2S_CHANNEL_MONO);
    i2s_adc_enable(I2S_NUM_0);
    delay(500); // required for stability of ADC

    // ***IMPORTANT*** enable continuous adc sampling
    SYSCON.saradc_ctrl2.meas_num_limit = 0;
    // sample time SAR setting
    SYSCON.saradc_ctrl.sar_clk_div = 2;
    SYSCON.saradc_fsm.sample_cycle = 2;
    adc_set_i2s_data_pattern(ADC_UNIT_1, 0, ADC_CHANNEL_0, ADC_WIDTH_BIT_12, cfg_adc_atten); // Input Vref 1.36V=4095,Offset 0.6324V=1744
    adc_set_i2s_data_len(ADC_UNIT_1, 1);

    i2s_set_pin(I2S_NUM_0, NULL);
    i2s_set_dac_mode(I2S_DAC_CHANNEL_LEFT_EN); // IO26
    i2s_zero_dma_buffer(I2S_NUM_0);
    // i2s_start(I2S_NUM_0);
    //  dac_output_enable(DAC_CHANNEL_1);
    // dac_output_enable(DAC_CHANNEL_2);
    // dac_i2s_enable();
    //}
}

void AFSK_TimerEnable(bool sts) {
    if (sts == true) {
        i2s_adc_enable(I2S_NUM_0);
        adcEn = 0;
    } else {
        i2s_adc_disable(I2S_NUM_0);
        adcEn = 0;
    }
}

#else

portMUX_TYPE timerMux = portMUX_INITIALIZER_UNLOCKED;

// static bool check_valid_data(const adc_digi_output_data_t *data);

// #define GET_UNIT(x) ((x >> 3) & 0x1)
// static uint16_t adc1_chan_mask = BIT(0);
// static uint16_t adc2_chan_mask = 0;
// static adc_channel_t channel[1] = {(adc_channel_t)ADC_CHANNEL_0};
#ifndef ADC_SAMPLE
static const char *TAG = "--(TAG ADC DMA)--";
#endif
#if defined(ADC_SAMPLE)
void IRAM_ATTR sample_adc_isr() {
    adcIsrCount++;
    if (!hw_afsk_dac_isr) {
        fifo.lock = true;
        // digitalWrite(15,HIGH);
        portENTER_CRITICAL_ISR(&timerMux); // ISR start
        int16_t adc = analogReadMilliVoltsISR(adc_pins[0]);

        // RingBuffer_Push(&fifo, adc);
        // if(fifo.head >= BUFFER_SIZE || fifo.head < 0) fifo.head = 0; // Check if head exceeds buffer size
        fifo.buffer[fifo.head] = adc;
        fifo.head = (fifo.head + 1) % BUFFER_SIZE; // Wrap around using modulo
        fifo.count++;
        portEXIT_CRITICAL_ISR(&timerMux); // ISR end
        // digitalWrite(15,LOW);
        fifo.lock = false;
    }
}
#endif
// Continuous-mode ADC digi output format is a per-SoC hardware property, not
// something ADC_SAMPLE (the legacy, disabled, single-shot path) has any
// bearing on. Classic ESP32 only supports TYPE1 in continuous mode; every
// other supported target (S2/S3/C3/C6/H2) uses TYPE2. This must match the
// type1/type2 selection in s_conv_done_cb() below exactly, or
// adc_continuous_config() silently fails and the ADC never starts.
#if defined(CONFIG_IDF_TARGET_ESP32)
#define ADC_OUTPUT_TYPE ADC_DIGI_OUTPUT_FORMAT_TYPE1
#else
#define ADC_OUTPUT_TYPE ADC_DIGI_OUTPUT_FORMAT_TYPE2
#endif

// Forward declerations
// int afsk_getchar(void);

// hw_timer_t *timer = NULL;

bool adcStopFlag = false;
void AFSK_TimerEnable(bool sts) {
    // if (xSemaphoreTake(xI2CSemaphore, (TickType_t)DEFAULT_SEMAPHORE_TIMEOUT) == pdTRUE)
    // {
    // vTaskSuspendAll ();
    // adcq.flush();
    // Note: fifo is initialized in AFSK_hw_init, not here
    portENTER_CRITICAL_ISR(&timerMux); // ISR start
    if (sts == true) {

#ifdef ADC_SAMPLE
        RingBuffer_IsEmpty(&fifo);
        timerStart(timer_adc);
#else
        //   timerAlarmEnable(timer);
        if (AdcHandle != NULL) {

