hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
#ifndef I2S_INTERNAL
int16_t adcPush;
// Lightweight diagnostic: min/max raw ADC code seen by the ISR since the last
// reset. Lets callers (e.g. the LOOP TEST) tell "ADC never saw any signal
// swing at all" (wiring/sampling/DAC problem) apart from "ADC saw a signal
// but the modem couldn't decode it" (filter/samplerate/level problem) instead
// of just failing with no data to go on either way.
static volatile int16_t s_adcDiagMin = 32767;
static volatile int16_t s_adcDiagMax = -32768;
void AFSK_resetAdcDiag(void) {
    s_adcDiagMin = 32767;
    s_adcDiagMax = -32768;
}
void AFSK_getAdcDiag(int16_t *out_min, int16_t *out_max) {
    *out_min = s_adcDiagMin;
    *out_max = s_adcDiagMax;
}
int AFSK_adcRawToMv(int16_t raw) {
    int mv = 0;
    if (AdcCaliHandle != NULL && adc_cali_raw_to_voltage(AdcCaliHandle, raw, &mv) == ESP_OK)
        return mv;
    // No calibration eFuses on this chip - Vref (set by afskSetADCAtten(),
    // matching the atten's approximate full-scale) is the best rough
    // estimate available: mv = raw/4095 * Vref.
    return (int)(((int32_t)raw * Vref) / 4095);
}
// static TaskHandle_t s_task_handle;
//  adc_oneshot_unit_handle_t adc1_handle;
#ifndef ADC_SAMPLE
// The single ADC channel actually configured in adc_continue_init() (channel
// 5 for GPIO33 on classic ESP32, adc_pins[0] otherwise). s_conv_done_cb must
// filter DMA results against *this*, not a hardcoded 0 - see the comment
// there for why "channel > 0" as a filter was silently dropping every
// sample on this board.
static adc_channel_t s_adc_channel = 0;

static bool IRAM_ATTR s_conv_done_cb(adc_continuous_handle_t stAdcHandle, const adc_continuous_evt_data_t *edata, void *user_data) {
    // In half-duplex mode, don't fill the FIFO during TX - matches
    // sample_adc_isr() gate on original ESP32. Without this, ~33,000 garbage
    // samples accumulate during TX and corrupt the demodulator state when
    // drained all at once, causing permanent RX freeze.
    // In full-duplex mode (tcb.fullDuplex, the default), RX must keep running
    // *during* TX - AFSK_Poll() also drains the FIFO concurrently in this
    // mode (see the matching hw_afsk_dac_isr/fullDuplex check there), so
    // there is no backlog to build up. This is also what makes the ADC/DAC
    // hardware loopback self-test possible: it can only decode its own
    // transmission if RX capture isn't blacked out for the entire TX burst.
    if (hw_afsk_dac_isr && !tcb.fullDuplex)
        return true;
    portENTER_CRITICAL_ISR(&timerMux);
    fifo.lock = true;
    for (uint32_t k = 0; k < edata->size; k += SOC_ADC_DIGI_RESULT_BYTES) {
        adc_digi_output_data_t *p = (adc_digi_output_data_t *)&edata->conv_frame_buffer[k];

#if defined(CONFIG_IDF_TARGET_ESP32)
        // BUG (was): "if (p->type1.channel > 0) continue;" hardcoded an
        // assumption that the configured channel is channel 0. That's true
        // on ESP32-S3 boards (GPIO1 = ADC1_CH0), which is why this went
        // unnoticed there, but on classic ESP32 the real audio-in pin is
        // GPIO33 = ADC1_CH5, so "channel > 0" was true for every single
        // sample and this silently discarded 100% of the DMA results -
        // fifo never got filled and the ADC min/max diagnostic never moved
        // from its sentinel value, exactly matching "the ADC never
        // captured a single sample" even though the driver/DMA was
        // running correctly the whole time. Compare against the channel
        // that was actually configured instead.
        if (p->type1.channel != s_adc_channel)
            continue;
        adcPush = (int16_t)p->type1.data;
#else
        if ((p->type2.channel != s_adc_channel) || (p->type2.unit > 0))
            continue;
        adcPush = (int)p->type2.data;
#endif

        if (fifo.head >= BUFFER_SIZE || fifo.head < 0)
            RingBuffer_Init(&fifo); // Check if head exceeds buffer size
                                    // fifo.head = 0; // Check if head exceeds buffer size
        fifo.buffer[fifo.head] = adcPush;
        fifo.head = (fifo.head + 1) % BUFFER_SIZE; // Wrap around using modulo
        fifo.count++;
        // RingBuffer_Push(&fifo, adcPush);
        if (adcPush < s_adcDiagMin)
            s_adcDiagMin = adcPush;
        if (adcPush > s_adcDiagMax)
            s_adcDiagMax = adcPush;
    }
    fifo.lock = false;
    portEXIT_CRITICAL_ISR(&timerMux);
    // vTaskDelay(TMP102_UPDATE_CICLE_MS / portTICK_PERIOD_MS);
    // return (mustYield == pdTRUE);
    return true;
}
// static TaskHandle_t s_task_handle;
// static bool IRAM_ATTR s_conv_done_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t *edata, void *user_data)
// {
//     BaseType_t mustYield = pdFALSE;
//     //Notify that ADC continuous driver has done enough number of conversions
//     vTaskNotifyGiveFromISR(s_task_handle, &mustYield);

//     return (mustYield == pdTRUE);
// }

void adc_continue_init(void) {
    adc_channel_t channel;
    adc_unit_t adc_unit = ADC_UNIT_1;
    esp_err_t Err = adc_continuous_io_to_channel(adc_pins[0], &adc_unit, &channel);
    if (Err != ESP_OK) {
        ESP_LOGE(TAG_AFSK, "Pin %u is not ADC pin!", adc_pins[0]);
    }
    if (adc_unit != 0) {
        ESP_LOGE(TAG_AFSK, "Only ADC1 pins are supported in continuous mode!");
    }
    // Record the real channel (e.g. 5 for GPIO33 on classic ESP32) so
    // s_conv_done_cb filters DMA results against it instead of an assumed
    // channel 0 - see the comment in s_conv_done_cb for why that mismatch
    // was silently discarding every captured sample on this board.
    s_adc_channel = channel;

    // Defensive: an RTC GPIO pull-up/pull-down left enabled (reset default,
    // or leftover from some other pinMode() call on this pad earlier in
    // boot) fights any weak analog source and pins the ADC to a rail - a
    // constant max-code, zero-swing reading being the classic symptom. The
    // continuous ADC driver does not touch pull config itself, so clear it
    // explicitly here rather than relying on it having never been set.
    gpio_set_pull_mode((gpio_num_t)adc_pins[0], GPIO_FLOATING);

