hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
    uint32_t conv_frame_size = (uint32_t)(BLOCK_SIZE * SOC_ADC_DIGI_RESULT_BYTES);
    // uint32_t conv_frame_size = ADC_SAMPLES_COUNT;
    /* On initialise l'ADC : */
    adc_continuous_handle_cfg_t AdcHandleConfig = {
        .max_store_buf_size = (uint32_t)conv_frame_size * 2,
        .conv_frame_size = (uint32_t)conv_frame_size,
    };
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
    AdcHandleConfig.flags.flush_pool = true;
#endif
    Err = adc_continuous_new_handle(&AdcHandleConfig, &AdcHandle);
    if (Err != ESP_OK)
        ESP_LOGE(TAG_AFSK, "AdMeasure : Adc Continuous Init Failed (err=%d).", Err);
    else {
        /* On configure l'ADC : */
        adc_continuous_config_t AdcConfig = {
#if defined(CONFIG_IDF_TARGET_ESP32)
            .sample_freq_hz = (uint32_t)(SAMPLERATE * 11 / 9),
#else
            .sample_freq_hz = (uint32_t)(SAMPLERATE),
#endif
            .conv_mode = ADC_CONV_SINGLE_UNIT_1, // On utilise uniquement l'ADC1.
            .format = ADC_OUTPUT_TYPE,           // On utilise le type 2. Pris dans l'exemple.
        };
        ESP_LOGD(TAG_AFSK, "ADC Continuous Configuration Done. SAMPLERATE: %d Hz", AdcConfig.sample_freq_hz);

        adc_digi_pattern_config_t adc_pattern[SOC_ADC_PATT_LEN_MAX] = { 0 };
        AdcConfig.pattern_num = 1;
        // for (int ii = 0; ii < NBR_CHANNELS; ii++)
        //{
        // uint8_t unit = ADC_UNIT_1;
        // uint8_t ch = channel & 0x7;
        adc_pattern[0].atten = cfg_adc_atten;
        adc_pattern[0].channel = channel;
        adc_pattern[0].unit = ADC_UNIT_1;
        adc_pattern[0].bit_width = SOC_ADC_DIGI_MAX_BITWIDTH;
        //}
        AdcConfig.adc_pattern = adc_pattern;
        Err = adc_continuous_config(AdcHandle, &AdcConfig);
        if (Err != ESP_OK)
            ESP_LOGE(TAG, "=====> AdMeasure : Adc Continuous Configuration Failed (err=%d).", Err);
        else {
            // Setup callbacks for complete event
            adc_continuous_evt_cbs_t cbs = {
                .on_conv_done = s_conv_done_cb,
                //.on_pool_ovf can be used in future
            };
            // adc_handle[adc_unit].adc_interrupt_handle.fn = (voidFuncPtr)userFunc;
            Err = adc_continuous_register_event_callbacks(AdcHandle, &cbs, NULL);
            if (Err != ESP_OK) {
                ESP_LOGE(TAG_AFSK, "adc_continuous_register_event_callbacks failed!");
            }

            // Attach the pins to the ADC unit
#ifdef ARDUINO_TEST
            for (int i = 0; i < cfg.channels; i++) {
                adc_channel = cfg.adc_channels[i];
                adc_continuous_channel_to_io(ADC_UNIT, adc_channel, &io_pin);
                // perimanSetPinBus: uint8_t pin, peripheral_bus_type_t type, void * bus, int8_t bus_num, int8_t bus_channel
                if (!perimanSetPinBus(io_pin, ESP32_BUS_TYPE_ADC_CONT, (void *)(ADC_UNIT + 1), ADC_UNIT, adc_channel)) {
                    LOGE("perimanSetPinBus to Continuous an ADC Unit %u failed!", ADC_UNIT);
                    return false;
                }
            }
#endif // I2C
// adc_cali_line_fitting_config_t cali_config = {
//       .unit_id = ADC_UNIT_1,
//       .bitwidth = ADC_BITWIDTH_12,
//       .atten = ADC_ATTEN_DB_0,
//     };

// adc_continuous_start(AdcHandle);

// adc_cali_line_fitting_config_t cali_config = {
//     .unit_id = ADC_UNIT_1,
//     .atten = ADC_ATTEN_DB_0,
//     .bitwidth = ADC_BITWIDTH_12,
// };
// ESP_LOGD(TAG_AFSK, "Creating ADC_UNIT_%d line cali handle", 1);
// Err = adc_cali_create_scheme_line_fitting(&cali_config, &AdcCaliHandle);
// // Err = adc_cali_create_scheme_curve_fitting(&Curve_Fitting, &AdcCaliHandle);
// if (Err != ESP_OK)
//   ESP_LOGI(TAG, "=====> AdMeasure : Fail to create the Curve Fitting Scheme.");
// else
// {
//   /* On démarre l'ADC : */
//   //SYSCON.saradc_ctrl2.meas_num_limit = 0;
//   adc_continuous_start(AdcHandle);
//   //adc_continuous_stop(AdcHandle);
//   //SYSCON.saradc_ctrl2.meas_num_limit = 0;
//   //HAL_FORCE_MODIFY_U32_REG_FIELD(SYSCON.saradc_ctrl2, meas_num_limit, 0);
//   ESP_LOGD(TAG_AFSK, "ADC Continuous has been start");
// }
/* Mise en place de la calibration permettant d'avoir les résultats en mV directement :
 * On utilise le schéma de calibration de type Courbe (Le seul proposé par la puce). */
#ifdef CONFIG_IDF_TARGET_ESP32
            adc_cali_line_fitting_config_t cali_config = {
#else
            adc_cali_curve_fitting_config_t cali_config = {
#endif
                .unit_id = ADC_UNIT_1,
                .atten = cfg_adc_atten,
                .bitwidth = ADC_BITWIDTH_12,
            };

#ifdef CONFIG_IDF_TARGET_ESP32
            Err = adc_cali_create_scheme_line_fitting(&cali_config, &AdcCaliHandle);
            ESP_LOGD(TAG_AFSK, "Creating ADC_UNIT_%d line cali handle", 1);
//
#else
            Err = adc_cali_create_scheme_curve_fitting(&cali_config, &AdcCaliHandle);
            ESP_LOGD(TAG_AFSK, "Creating ADC_UNIT_%d cerve cali handle", 1);
//
#endif

            // s_task_handle = xTaskGetCurrentTaskHandle();

            if (Err != ESP_OK)
                ESP_LOGI(TAG, "=====> AdMeasure : Fail to create the Curve Fitting Scheme. Continuing without "
                              "calibrated mV/RMS reporting - this board likely has no factory ADC calibration "
                              "eFuses burned. Raw-code AFSK demodulation is unaffected.");

            // Start the ADC continuous driver regardless of whether the
            // calibration scheme above succeeded - AdcCaliHandle is only used
            // later for cosmetic mV/RMS reporting (adc_cali_raw_to_voltage()),
            // never for the raw ADC codes the demodulator itself decodes, so a
            // failed/unsupported calibration scheme must never prevent the
            // ADC from actually sampling.
            adc_continuous_start(AdcHandle);
            ESP_LOGD(TAG_AFSK, "ADC Continuous has been start");
            adcStopFlag = false;
        }
    }
}
#endif
#endif // I2C

/*
 * Real DAC output (classic ESP32 / ESP32-S2 only): drives the internal 8-bit
 * R-2R DAC hardware directly. On classic ESP32, DAC_CHAN_0 = GPIO25 (DAC1).
 * dac_oneshot_output_voltage() is explicitly documented as ISR-safe, so it can
 * be called straight from sample_dac_isr() at the modem sample rate.
 */
#ifdef AFSK_HAS_REAL_DAC
static dac_oneshot_handle_t s_dac_chan = NULL;

