hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
static void real_dac_init(void) {
    dac_oneshot_config_t dac_cfg = {
        .chan_id = DAC_CHAN_0, // GPIO25 (DAC1) on classic ESP32
    };
    ESP_ERROR_CHECK(dac_oneshot_new_channel(&dac_cfg, &s_dac_chan));
    dac_oneshot_output_voltage(s_dac_chan, 127); // idle at mid-scale (silence)
}
#else
/*
 * Configure and initialize the sigma delta modulation
 * on channel 0 to output signal on GPIO4
 */
static sdm_channel_handle_t sdm_chan = NULL;

static void sigmadelta_init(void) {
    sdm_config_t sdm_cfg = {
        .clk_src = SDM_CLK_SRC_DEFAULT,
        .sample_rate_hz = 96 * 8 * 1000, // equivalent to old prescale=96 setting
#ifdef CONFIG_IDF_TARGET_ESP32C3
        .gpio_num = GPIO_NUM_1, // GPIO1 is used for ESP32C3
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
        .gpio_num = GPIO_NUM_2, // GPIO2 is used for ESP32S3
#else
        .gpio_num = GPIO_NUM_26,
#endif
    };
    ESP_ERROR_CHECK(sdm_new_channel(&sdm_cfg, &sdm_chan));
    ESP_ERROR_CHECK(sdm_channel_set_pulse_density(sdm_chan, 0));
    ESP_ERROR_CHECK(sdm_channel_enable(sdm_chan));
}
#endif

void AFSK_hw_init(void) {
    // Set up ADC
    if (_sql_pin > -1)
        pinMode(_sql_pin, INPUT_PULLUP);
    if (_pwr_pin > -1)
        pinMode(_pwr_pin, OUTPUT);
    if (_led_tx_pin > -1) {
        pinMode(_led_tx_pin, OUTPUT);
    }
    if (_led_rx_pin > -1) {
        pinMode(_led_rx_pin, OUTPUT);
    }
    if (_led_strip_pin > -1) {
        //ws2812_init(_led_strip_pin);
    }

    if (_pwr_pin > -1)
        digitalWrite(_pwr_pin, !_pwr_active);

    // Drive the PTT pin to its inactive level right away. Without this it is
    // left as a floating input (default GPIO reset state) until the very
    // first real TX calls setPtt() from modem.c - and getTransmit() polls
    // this same pin on every AFSK_Poll() cycle. If the floating pin happens
    // to read as "active" (very likely with no external pull), getTransmit()
    // returns true permanently, AFSK_Poll() takes the TX branch forever, and
    // the RX/demodulator path never runs at all - independent of any
    // ADC/DAC wiring, this alone can make RX (and the loop test) look
    // completely dead from boot.
    if (_ptt_pin > -1)
        setPtt(false);

    RingBuffer_Init(&fifo); // Initialize the ring buffer

#ifdef I2S_INTERNAL
    //  Initialize the I2S peripheral
    I2S_Init(I2S_MODE_DAC_BUILT_IN, I2S_BITS_PER_SAMPLE_16BIT);
#else

#ifdef ADC_SAMPLE
    // Legacy gptimer + adc_oneshot_read_isr() sampling path - no longer
    // enabled for any target (see the ADC_SAMPLE comment near the top of
    // this file for why). Left only so this branch still compiles if
    // something re-defines ADC_SAMPLE in the future; adc_continue_init()
    // in the #else branch below is the live code path on every target.
    pinMode(15, OUTPUT);
    analogReadResolution(12);
    analogSetPinAttenuation(adc_pins[0], cfg_adc_atten);
    timer_adc = timerBegin(20000000);
    timerAttachInterrupt(timer_adc, &sample_adc_isr);
    timerAlarm(timer_adc, (uint64_t)20000000 / SAMPLERATE, true, 0);
    timerStart(timer_adc);

#else
    adc_continue_init();
#endif

// Initialize FIR filter
// resample_fir.coeffs = (float *)resample_coeffs;
// resample_fir.delay = filter_state;
// resample_fir.N = FILTER_TAPS;
// resample_fir.pos = 0;

// pinMode(MIC_PIN, INPUT);
//  Init ADC and Characteristics
//  esp_adc_cal_characteristics_t characteristics;
//  adc1_config_width(ADC_WIDTH_BIT_12);
//  adc1_config_channel_atten(SPK_PIN, cfg_adc_atten); // Input 1.24Vp-p,Use R 33K-(10K//10K) divider input power 1.2Vref
//  esp_adc_cal_characterize(ADC_UNIT_1, cfg_adc_atten, ADC_WIDTH_BIT_12, 0, &adc1_chars);

// adc1_config_channel_atten(SPK_PIN, ADC_ATTEN_DB_12); //Input 3.3Vp-p,Use R 10K divider input power 3.3V
// esp_adc_cal_get_characteristics(V_REF, ADC_ATTEN_DB_12, ADC_WIDTH_BIT_12, &characteristics);
// ESP_LOGD(TAG_AFSK, "v_ref routed to 3.3V\n");
#endif

#ifdef AFSK_HAS_REAL_DAC
    real_dac_init();
    ESP_LOGD(TAG_AFSK, "Real DAC initialized (GPIO25 / DAC_CHAN_0)");
#else
    sigmadelta_init();
    ESP_LOGD(TAG_AFSK, "Sigma Delta Initialized");
#endif
    // Create semaphore to inform us when the timer has fired
    // timerSemaphore = xSemaphoreCreateBinary();
    // Set timer frequency to 20Mhz
    timer_dac = timerBegin(20000000);
    // Attach onTimer function to our timer.
    timerAttachInterrupt(timer_dac, &sample_dac_isr); // Attaches the handler function to the timer
    // Set alarm to call onTimer function every second (value in microseconds).
    // Repeat the alarm (third parameter) with unlimited count = 0 (fourth parameter).
    timerAlarm(timer_dac, (uint64_t)20000000 / CONFIG_AFSK_DAC_SAMPLERATE, true, 0);
    timerStop(timer_dac);

    //   ESP_LOGI(TAG, "Create timer handle");
    //   gptimer_handle_t gptimer = NULL;
    //   gptimer_config_t timer_config = {
    //       .clk_src = GPTIMER_CLK_SRC_DEFAULT,
    //       .direction = GPTIMER_COUNT_UP,
    //       .resolution_hz = 8000000, // 1MHz, 1 tick=1us
    //   };
    //   ESP_ERROR_CHECK(gptimer_new_timer(&timer_config, &gptimer));

    //   gptimer_event_callbacks_t cbs = {
    //       .on_alarm = example_timer_on_alarm_cb,
    //   };
    //   ESP_ERROR_CHECK(gptimer_register_event_callbacks(gptimer, &cbs, queue));

    //   ESP_LOGI(TAG, "Enable timer");
    //   ESP_ERROR_CHECK(gptimer_enable(gptimer));

    //   ESP_LOGI(TAG, "Start timer, stop it at alarm event");
    //   gptimer_alarm_config_t alarm_config1 = {
    //       .alarm_count = (uint64_t)8000000/ SAMPLERATE, // period = 1s
    //   };
    //   alarm_config1.flags.auto_reload_on_alarm = true;
    //   alarm_config1.reload_count = 0;
    //   ESP_ERROR_CHECK(gptimer_set_alarm_action(gptimer, &alarm_config1));
    //   ESP_ERROR_CHECK(gptimer_start(gptimer));
    // if (xQueueReceive(queue, &ele, pdMS_TO_TICKS(2000))) {
    //     ESP_LOGI(TAG, "Timer stopped, count=%llu", ele.event_count);
    // } else {
    //     ESP_LOGW(TAG, "Missed one count event");
    // }

    setTransmit(false);
    ESP_LOGD(TAG_AFSK, "AFSK Hardware Initialized");
}

