hiperiondev/esp32idf_APRS/components/esp32_IDF_libAPRS/AFSK.c
void AFSK_init(int8_t adc_pin, int8_t dac_pin, int8_t ptt_pin, int8_t sql_pin, int8_t pwr_pin, int8_t led_tx_pin, int8_t led_rx_pin, int8_t led_strip_pin,
               bool ptt_act, bool sql_act, bool pwr_act) {
    _adc_pin = adc_pin;
    _dac_pin = dac_pin;
    _ptt_pin = ptt_pin;
    _sql_pin = sql_pin;
    _pwr_pin = pwr_pin;
    _led_tx_pin = led_tx_pin;
    _led_rx_pin = led_rx_pin;
    _led_strip_pin = led_strip_pin;

    _ptt_active = ptt_act;
    _sql_active = sql_act;
    _pwr_active = pwr_act;

    if (xI2CSemaphore == NULL) {
        xI2CSemaphore = xSemaphoreCreateMutex();
        if ((xI2CSemaphore) != NULL)
            xSemaphoreGive((xI2CSemaphore));
    }

    tcb_t *tp = &tcb;
    int i = 0;
    tp->port = i;
    tp->kiss_type = i << 4;
    tp->avg = 2048;
    tp->cdt = false;
    tp->cdt_lvl = 0;
    tp->cdt_led_pin = 2;
    tp->cdt_led_on = 2;
    ESP_LOGD(TAG_AFSK, "cdt_led_pin = %d, cdt_led_on = %d, port = %d", tp->cdt_led_pin, tp->cdt_led_on, tp->port);
// tp->ptt_pin = 12;
#ifdef FX25TNCR2
    tp->sta_led_pin = STA_LED_PIN[i];
#endif

#ifdef FX25_ENABLE
    tp->fx25_parity = FX25_PARITY[i]; // FX.25 parity
#endif
    tp->cdt_sem = xSemaphoreCreateBinary();
    assert(tp->cdt_sem);
    assert(xSemaphoreGive(tp->cdt_sem) == pdTRUE); // initialize

    // KISS default parameter
    // tp->fullDuplex = kiss_fullduplex[i]; // half duplex
    tp->fullDuplex = true;  // full duplex
    tp->SlotTime = 10;      // 100ms
    tp->TXDELAY = 50;       // 500ms
    tp->persistence_P = 63; // P = 0.25
    AFSK_hw_init();
}

// ADC memory cleanup function to prevent heap leaks
void AFSK_deinit() {
    ESP_LOGD(TAG_AFSK, "AFSK deinitialization - cleaning up ADC resources");

#ifdef AFSK_HAS_REAL_DAC
    // Release the real DAC channel so it can be re-registered on the next init
    if (s_dac_chan != NULL) {
        dac_oneshot_del_channel(s_dac_chan);
        s_dac_chan = NULL;
        ESP_LOGD(TAG_AFSK, "DAC oneshot channel deleted");
    }
#endif

    // Stop ADC if running
    if (AdcHandle != NULL) {
        adc_continuous_stop(AdcHandle);
        ESP_LOGD(TAG_AFSK, "ADC continuous stopped");
    }

    // Free audio buffer memory
    if (audio_buffer != NULL) {
        free(audio_buffer);
        audio_buffer = NULL;
        ESP_LOGD(TAG_AFSK, "Audio buffer freed");
    }

    // Delete ADC calibration handle to free calibration memory
    if (AdcCaliHandle != NULL) {
#if defined(CONFIG_IDF_TARGET_ESP32)
        adc_cali_delete_scheme_line_fitting(AdcCaliHandle);
        ESP_LOGD(TAG_AFSK, "ADC calibration handle (line fitting) deleted");
#else
        adc_cali_delete_scheme_curve_fitting(AdcCaliHandle);
        ESP_LOGD(TAG_AFSK, "ADC calibration handle (curve fitting) deleted");
#endif
        AdcCaliHandle = NULL;
    }

    // Delete ADC continuous handle to free ADC memory
    if (AdcHandle != NULL) {
        adc_continuous_deinit(AdcHandle);
        ESP_LOGD(TAG_AFSK, "ADC continuous handle deleted");
        AdcHandle = NULL;
    }

    ESP_LOGD(TAG_AFSK, "AFSK deinitialization completed - ADC memory freed");
}

int offset = 0;
int dc_offset = 620;
// void afskSetDCOffset(int val)
// {
//   dc_offset = offset = val;
// }

// bool dac_push(uint8_t data)
// {
//   if (dacq.isFull())
//   {
//     delay(5);
//   }
//   dacq.push(&data);
//   return true;
// }

bool sqlActive = false;

// #ifndef I2S_INTERNAL
//  int x=0;

uint8_t sinwave = 127;

bool adcq_lock = false;

uint16_t phaseAcc = 0;

void IRAM_ATTR sample_dac_isr() {
    if (hw_afsk_dac_isr) {
        portENTER_CRITICAL_ISR(&timerMux); // ISR start
        sinwave = MODEM_BAUDRATE_TIMER_HANDLER();
#ifdef AFSK_HAS_REAL_DAC
        // BUG (was): sinwave was written to the DAC at full 0-255 swing
        // (0-~3.3V). Espressif's own ADC characteristics put the *real*
        // linear/measurable ceiling around ~2450mV even at the max
        // available attenuation (ADC_ATTEN_DB_12) - the top portion of a
        // full-swing DAC signal is therefore hard-clipped by the ADC no
        // matter what atten is configured, which is exactly what the LOOP
        // TEST diagnostics showed (raw code pinned at 4095 on every peak).
        // A clipped/flat-topped AFSK tone is heavily distorted and the PLL
        // demodulator can't reliably lock onto it. The sigma-delta path
        // below already reduces its swing to ~-85..85 (out of -128..127)
        // for this same reason - apply the same ~75% headroom scaling here
        // so the real-DAC path stays within the ADC's actual linear range.
        int16_t dacOut = 127 + (((int16_t)sinwave - 127) * 3) / 4; // ~75% amplitude, centered at 127
        if (dacOut < 0)
            dacOut = 0;
        else if (dacOut > 255)
            dacOut = 255;
        // dac_oneshot_output_voltage() is documented as ISR-safe.
        dac_oneshot_output_voltage(s_dac_chan, (uint8_t)dacOut);
#else
        // Sigma-delta duty of one channel, the value ranges from -128 to 127, recommended range is -90 ~ 90.The waveform is more like a random one in this
        // range.
        int8_t sine = (int8_t)(((sinwave - 127) * 12) >> 4); // Redue sine = -85 ~ 85
        sdm_channel_set_pulse_density(sdm_chan, sine);
#endif
        portEXIT_CRITICAL_ISR(&timerMux); // ISR end
                                          // Give a semaphore that we can check in the loop
                                          // xSemaphoreGiveFromISR(timerSemaphore, NULL);
    }
}

int mVrms;
float dBV;

long mVsum = 0;
int mVsumCount = 0;
uint8_t dcd_cnt = 0;
bool sqlActiveOld = false;
#define READ_LEN 256
// uint32_t ret_num = 0;
// uint8_t resultADC[READ_LEN] = {0};

void AFSK_Poll(bool SA818, bool RFPower) {
    fifoSampleCount = fifo.count; // Diagnostic snapshot
    int mV;
    int x = 0;
    int16_t adc = 0;
    // uint8_t sintable[8] = {127, 217, 254, 217, 127, 36, 0, 36};
#ifdef I2S_INTERNAL
    size_t bytesRead;
    uint16_t pcm_in[ADC_SAMPLES_COUNT];
    uint16_t pcm_out[ADC_SAMPLES_COUNT];
#endif

    if (_sql_pin > -1) {                                  // Set SQL pin active
        if ((digitalRead(_sql_pin) ^ _sql_active) == 0) { // signal active with sql_active
            sqlActive = true;
#if defined(ADC_SAMPLE)
            if (sqlActiveOld == false) {
                AFSK_TimerEnable(true); // Start ADC if SQL pin is set
            }
#endif
        } else {
            sqlActive = false;
            if (sqlActiveOld == true) {
#if defined(ADC_SAMPLE)
                AFSK_TimerEnable(false); // Stop ADC if SQL pin is not set
#endif
                LED_Status2(0, 0, 0);
            }
        }
    } else {
        sqlActive = true;
    }
    sqlActiveOld = sqlActive;

    // The body of this branch (TX-side I2S/DAC bookkeeping) is legacy,
    // fully-commented-out dead code from the old I2S_INTERNAL path - it does
    // nothing on the live (adc_continuous) path this project actually builds.
    // In full-duplex mode (tcb.fullDuplex, the default), fall through to the
    // real RX/demodulator branch below even while transmitting, matching the
    // s_conv_done_cb() fifo-fill gate above - otherwise RX (and the ADC/DAC
    // loopback self-test, which decodes its own TX) can never work at all.
    if (hw_afsk_dac_isr && !tcb.fullDuplex) {

